# Data Wrangling 3

## Pandas dla Bazodanowców

### Łaczenie `DataFrame` między sobą ... i z bazą danych

---

In [67]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame(np.random.randn(10_000, 4), columns=list('ABCD'))

df1

             A         B         C         D
0     0.291140  0.358059  0.730346 -0.009350
1    -0.436912 -0.536876  1.097087  1.549681
2    -0.444503 -0.709929 -1.265413 -0.176317
3    -0.220561  1.387429  0.101777 -0.120509
4    -0.083410 -0.407776 -0.658918  0.997564
...        ...       ...       ...       ...
9995  0.763992  0.406312  1.432457  1.134807
9996  1.442311  0.313257 -0.915869 -1.546082
9997 -0.736613 -0.603456 -1.150110 -0.355061
9998  1.477478  1.263256  0.837152 -0.035509
9999 -0.186869 -2.621155  0.100796 -0.553478

[10000 rows x 4 columns]

In [68]:
import pandas as pd
import numpy as np
df2 = pd.DataFrame(np.random.randn(10_000, 4), columns=list('ABCD'))

df2

             A         B         C         D
0    -0.419151 -1.965473 -1.250760  0.120242
1    -0.233592  0.937221 -1.906583  1.308496
2    -0.856394  1.194222 -0.447659  0.603526
3     1.124501 -0.223621 -1.354385  0.642157
4    -0.869481 -1.033739  1.281301 -0.179659
...        ...       ...       ...       ...
9995  1.235691 -0.666455  1.242307 -0.313222
9996  0.659312  0.568377  1.806502 -0.144138
9997 -0.044663 -0.406522 -1.366073  1.794683
9998 -1.007820  0.700271  0.322137 -1.511588
9999  1.472715  0.854174  1.056306 -0.419613

[10000 rows x 4 columns]

In [69]:
pd.concat([df1, df2])

             A         B         C         D
0     0.291140  0.358059  0.730346 -0.009350
1    -0.436912 -0.536876  1.097087  1.549681
2    -0.444503 -0.709929 -1.265413 -0.176317
3    -0.220561  1.387429  0.101777 -0.120509
4    -0.083410 -0.407776 -0.658918  0.997564
...        ...       ...       ...       ...
9995  1.235691 -0.666455  1.242307 -0.313222
9996  0.659312  0.568377  1.806502 -0.144138
9997 -0.044663 -0.406522 -1.366073  1.794683
9998 -1.007820  0.700271  0.322137 -1.511588
9999  1.472715  0.854174  1.056306 -0.419613

[20000 rows x 4 columns]

In [70]:
pd.concat([df1, df2]).reset_index()

       index         A         B         C         D
0          0  0.291140  0.358059  0.730346 -0.009350
1          1 -0.436912 -0.536876  1.097087  1.549681
2          2 -0.444503 -0.709929 -1.265413 -0.176317
3          3 -0.220561  1.387429  0.101777 -0.120509
4          4 -0.083410 -0.407776 -0.658918  0.997564
...      ...       ...       ...       ...       ...
19995   9995  1.235691 -0.666455  1.242307 -0.313222
19996   9996  0.659312  0.568377  1.806502 -0.144138
19997   9997 -0.044663 -0.406522 -1.366073  1.794683
19998   9998 -1.007820  0.700271  0.322137 -1.511588
19999   9999  1.472715  0.854174  1.056306 -0.419613

[20000 rows x 5 columns]

In [71]:
pd.concat([df1, df2], keys=["DF1", "DF2"])

                 A         B         C         D
DF1 0     0.291140  0.358059  0.730346 -0.009350
    1    -0.436912 -0.536876  1.097087  1.549681
    2    -0.444503 -0.709929 -1.265413 -0.176317
    3    -0.220561  1.387429  0.101777 -0.120509
    4    -0.083410 -0.407776 -0.658918  0.997564
...            ...       ...       ...       ...
DF2 9995  1.235691 -0.666455  1.242307 -0.313222
    9996  0.659312  0.568377  1.806502 -0.144138
    9997 -0.044663 -0.406522 -1.366073  1.794683
    9998 -1.007820  0.700271  0.322137 -1.511588
    9999  1.472715  0.854174  1.056306 -0.419613

[20000 rows x 4 columns]

In [72]:
pd.concat([df1, df2], axis=1)

,A,B,C,D,A,B,C,D
0,0.291140,0.358059,0.730346,-0.009350,-0.419151,-1.965473,-1.250760,0.120242
1,-0.436912,-0.536876,1.097087,1.549681,-0.233592,0.937221,-1.906583,1.308496
2,-0.444503,-0.709929,-1.265413,-0.176317,-0.856394,1.194222,-0.447659,0.603526
3,-0.220561,1.387429,0.101777,-0.120509,1.124501,-0.223621,-1.354385,0.642157
4,-0.083410,-0.407776,-0.658918,0.997564,-0.869481,-1.033739,1.281301,-0.179659
...,...,...,...,...,...,...,...,...
9995,0.763992,0.406312,1.432457,1.134807,1.235691,-0.666455,1.242307,-0.313222
9996,1.442311,0.313257,-0.915869,-1.546082,0.659312,0.568377,1.806502,-0.144138
9997,-0.736613,-0.603456,-1.150110,-0.355061,-0.044663,-0.406522,-1.366073,1.794683
9998,1.477478,1.263256,0.837152,-0.035509,-1.007820,0.700271,0.322137,-1.511588
9999,-0.186869,-2.621155,0.100796,-0.553478,1.472715,0.854174,1.056306,-0.419613

In [73]:
pd.concat([df1, df2], axis=1, keys=["DF1", "DF2"])

           DF1                                     DF2                      \
             A         B         C         D         A         B         C
0     0.291140  0.358059  0.730346 -0.009350 -0.419151 -1.965473 -1.250760
1    -0.436912 -0.536876  1.097087  1.549681 -0.233592  0.937221 -1.906583
2    -0.444503 -0.709929 -1.265413 -0.176317 -0.856394  1.194222 -0.447659
3    -0.220561  1.387429  0.101777 -0.120509  1.124501 -0.223621 -1.354385
4    -0.083410 -0.407776 -0.658918  0.997564 -0.869481 -1.033739  1.281301
...        ...       ...       ...       ...       ...       ...       ...
9995  0.763992  0.406312  1.432457  1.134807  1.235691 -0.666455  1.242307
9996  1.442311  0.313257 -0.915869 -1.546082  0.659312  0.568377  1.806502
9997 -0.736613 -0.603456 -1.150110 -0.355061 -0.044663 -0.406522 -1.366073
9998  1.477478  1.263256  0.837152 -0.035509 -1.007820  0.700271  0.322137
9999 -0.186869 -2.621155  0.100796 -0.553478  1.472715  0.854174  1.056306


             D
0     0.120242
1     1.308496
2     0.603526
3     0.642157
4    -0.179659
...        ...
9995 -0.313222
9996 -0.144138
9997  1.794683
9998 -1.511588
9999 -0.419613

[10000 rows x 8 columns]

In [74]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.random.randn(10_000, 3), columns=list('ABC'))

df1

             A         B         C
0     0.294058 -0.608865 -0.675609
1    -0.348680  0.088505  0.138804
2    -0.670031 -0.284784 -0.385483
3     1.632578 -0.204136  0.758161
4    -0.144515 -1.476366  0.627368
...        ...       ...       ...
9995  1.360779 -1.326233 -0.421502
9996 -0.833311 -0.464816 -0.413557
9997 -2.247892 -0.319841 -1.007784
9998 -0.770215  0.541555 -1.960953
9999  2.330945 -0.065626 -0.324061

[10000 rows x 3 columns]

In [75]:
df2 = pd.DataFrame(np.random.randn(1_000, 2), columns=list('EF'))

df2

            E         F
0   -1.897952  1.645780
1   -0.306025 -1.647525
2   -0.023045 -1.034967
3    0.862255 -0.015482
4    1.982186  0.280840
..        ...       ...
995  0.350883  1.016367
996  1.397034  2.873318
997 -0.023402  0.201442
998  1.127256 -0.325321
999 -0.686507  1.295980

[1000 rows x 2 columns]

In [76]:
pd.concat([df1, df2])

            A         B         C         E         F
0    0.294058 -0.608865 -0.675609       NaN       NaN
1   -0.348680  0.088505  0.138804       NaN       NaN
2   -0.670031 -0.284784 -0.385483       NaN       NaN
3    1.632578 -0.204136  0.758161       NaN       NaN
4   -0.144515 -1.476366  0.627368       NaN       NaN
..        ...       ...       ...       ...       ...
995       NaN       NaN       NaN  0.350883  1.016367
996       NaN       NaN       NaN  1.397034  2.873318
997       NaN       NaN       NaN -0.023402  0.201442
998       NaN       NaN       NaN  1.127256 -0.325321
999       NaN       NaN       NaN -0.686507  1.295980

[11000 rows x 5 columns]

In [77]:
pd.concat([df1, df2], axis=1)

             A         B         C         E         F
0     0.294058 -0.608865 -0.675609 -1.897952  1.645780
1    -0.348680  0.088505  0.138804 -0.306025 -1.647525
2    -0.670031 -0.284784 -0.385483 -0.023045 -1.034967
3     1.632578 -0.204136  0.758161  0.862255 -0.015482
4    -0.144515 -1.476366  0.627368  1.982186  0.280840
...        ...       ...       ...       ...       ...
9995  1.360779 -1.326233 -0.421502       NaN       NaN
9996 -0.833311 -0.464816 -0.413557       NaN       NaN
9997 -2.247892 -0.319841 -1.007784       NaN       NaN
9998 -0.770215  0.541555 -1.960953       NaN       NaN
9999  2.330945 -0.065626 -0.324061       NaN       NaN

[10000 rows x 5 columns]

In [78]:
pd.concat([df1, df2], axis=1, join='inner')

            A         B         C         E         F
0    0.294058 -0.608865 -0.675609 -1.897952  1.645780
1   -0.348680  0.088505  0.138804 -0.306025 -1.647525
2   -0.670031 -0.284784 -0.385483 -0.023045 -1.034967
3    1.632578 -0.204136  0.758161  0.862255 -0.015482
4   -0.144515 -1.476366  0.627368  1.982186  0.280840
..        ...       ...       ...       ...       ...
995  0.780412  1.295595  1.409931  0.350883  1.016367
996 -0.376573  0.129447  0.418093  1.397034  2.873318
997 -0.771587 -0.254557 -0.631149 -0.023402  0.201442
998 -1.300958  0.303052  0.994789  1.127256 -0.325321
999  0.119748  1.486243  0.361847 -0.686507  1.295980

[1000 rows x 5 columns]

In [79]:
pd.concat([df1, df2], axis=1, join='outer')

             A         B         C         E         F
0     0.294058 -0.608865 -0.675609 -1.897952  1.645780
1    -0.348680  0.088505  0.138804 -0.306025 -1.647525
2    -0.670031 -0.284784 -0.385483 -0.023045 -1.034967
3     1.632578 -0.204136  0.758161  0.862255 -0.015482
4    -0.144515 -1.476366  0.627368  1.982186  0.280840
...        ...       ...       ...       ...       ...
9995  1.360779 -1.326233 -0.421502       NaN       NaN
9996 -0.833311 -0.464816 -0.413557       NaN       NaN
9997 -2.247892 -0.319841 -1.007784       NaN       NaN
9998 -0.770215  0.541555 -1.960953       NaN       NaN
9999  2.330945 -0.065626 -0.324061       NaN       NaN

[10000 rows x 5 columns]

In [80]:
df0 = df1.drop(range(500)).reset_index()
df0

      index         A         B         C
0       500  0.553991  0.954633 -1.088224
1       501 -1.004000 -0.163454  0.278943
2       502  1.717211  0.133925 -0.094558
3       503  2.108882 -0.245954 -0.926120
4       504 -0.441644  0.482727  0.852975
...     ...       ...       ...       ...
9495   9995  1.360779 -1.326233 -0.421502
9496   9996 -0.833311 -0.464816 -0.413557
9497   9997 -2.247892 -0.319841 -1.007784
9498   9998 -0.770215  0.541555 -1.960953
9499   9999  2.330945 -0.065626 -0.324061

[9500 rows x 4 columns]

In [81]:
df3 = df2.reset_index()
df3

     index         E         F
0        0 -1.897952  1.645780
1        1 -0.306025 -1.647525
2        2 -0.023045 -1.034967
3        3  0.862255 -0.015482
4        4  1.982186  0.280840
..     ...       ...       ...
995    995  0.350883  1.016367
996    996  1.397034  2.873318
997    997 -0.023402  0.201442
998    998  1.127256 -0.325321
999    999 -0.686507  1.295980

[1000 rows x 3 columns]

In [82]:
pd.merge(df0, df3, on='index')

     index         A         B         C         E         F
0      500  0.553991  0.954633 -1.088224 -0.823134  0.206365
1      501 -1.004000 -0.163454  0.278943  0.130518  0.111013
2      502  1.717211  0.133925 -0.094558 -0.108244  0.915917
3      503  2.108882 -0.245954 -0.926120 -0.416207 -0.734235
4      504 -0.441644  0.482727  0.852975  0.171212  0.282009
..     ...       ...       ...       ...       ...       ...
495    995  0.780412  1.295595  1.409931  0.350883  1.016367
496    996 -0.376573  0.129447  0.418093  1.397034  2.873318
497    997 -0.771587 -0.254557 -0.631149 -0.023402  0.201442
498    998 -1.300958  0.303052  0.994789  1.127256 -0.325321
499    999  0.119748  1.486243  0.361847 -0.686507  1.295980

[500 rows x 6 columns]

In [83]:
pd.merge(df0, df3, on='index', how='inner')

     index         A         B         C         E         F
0      500  0.553991  0.954633 -1.088224 -0.823134  0.206365
1      501 -1.004000 -0.163454  0.278943  0.130518  0.111013
2      502  1.717211  0.133925 -0.094558 -0.108244  0.915917
3      503  2.108882 -0.245954 -0.926120 -0.416207 -0.734235
4      504 -0.441644  0.482727  0.852975  0.171212  0.282009
..     ...       ...       ...       ...       ...       ...
495    995  0.780412  1.295595  1.409931  0.350883  1.016367
496    996 -0.376573  0.129447  0.418093  1.397034  2.873318
497    997 -0.771587 -0.254557 -0.631149 -0.023402  0.201442
498    998 -1.300958  0.303052  0.994789  1.127256 -0.325321
499    999  0.119748  1.486243  0.361847 -0.686507  1.295980

[500 rows x 6 columns]

In [84]:
pd.merge(df0, df3, on='index', how="outer")

      index         A         B         C         E         F
0       500  0.553991  0.954633 -1.088224 -0.823134  0.206365
1       501 -1.004000 -0.163454  0.278943  0.130518  0.111013
2       502  1.717211  0.133925 -0.094558 -0.108244  0.915917
3       503  2.108882 -0.245954 -0.926120 -0.416207 -0.734235
4       504 -0.441644  0.482727  0.852975  0.171212  0.282009
...     ...       ...       ...       ...       ...       ...
9995    495       NaN       NaN       NaN  1.312382 -0.217335
9996    496       NaN       NaN       NaN  1.407787 -1.737530
9997    497       NaN       NaN       NaN -0.760182  0.220100
9998    498       NaN       NaN       NaN  1.306037 -1.086145
9999    499       NaN       NaN       NaN  2.316153  0.602643

[10000 rows x 6 columns]

In [85]:
pd.merge(df0, df3, on='index', how="left")

      index         A         B         C         E         F
0       500  0.553991  0.954633 -1.088224 -0.823134  0.206365
1       501 -1.004000 -0.163454  0.278943  0.130518  0.111013
2       502  1.717211  0.133925 -0.094558 -0.108244  0.915917
3       503  2.108882 -0.245954 -0.926120 -0.416207 -0.734235
4       504 -0.441644  0.482727  0.852975  0.171212  0.282009
...     ...       ...       ...       ...       ...       ...
9495   9995  1.360779 -1.326233 -0.421502       NaN       NaN
9496   9996 -0.833311 -0.464816 -0.413557       NaN       NaN
9497   9997 -2.247892 -0.319841 -1.007784       NaN       NaN
9498   9998 -0.770215  0.541555 -1.960953       NaN       NaN
9499   9999  2.330945 -0.065626 -0.324061       NaN       NaN

[9500 rows x 6 columns]

In [86]:
pd.merge(df0, df3, on='index', how="right")

     index         A         B         C         E         F
0        0       NaN       NaN       NaN -1.897952  1.645780
1        1       NaN       NaN       NaN -0.306025 -1.647525
2        2       NaN       NaN       NaN -0.023045 -1.034967
3        3       NaN       NaN       NaN  0.862255 -0.015482
4        4       NaN       NaN       NaN  1.982186  0.280840
..     ...       ...       ...       ...       ...       ...
995    995  0.780412  1.295595  1.409931  0.350883  1.016367
996    996 -0.376573  0.129447  0.418093  1.397034  2.873318
997    997 -0.771587 -0.254557 -0.631149 -0.023402  0.201442
998    998 -1.300958  0.303052  0.994789  1.127256 -0.325321
999    999  0.119748  1.486243  0.361847 -0.686507  1.295980

[1000 rows x 6 columns]

In [87]:
df0.join(df3, lsuffix="_left", rsuffix="_right")

,index_left,A,B,C,index_right,E,F
0,500,0.553991,0.954633,-1.088224,0.0,-1.897952,1.645780
1,501,-1.004000,-0.163454,0.278943,1.0,-0.306025,-1.647525
2,502,1.717211,0.133925,-0.094558,2.0,-0.023045,-1.034967
3,503,2.108882,-0.245954,-0.926120,3.0,0.862255,-0.015482
4,504,-0.441644,0.482727,0.852975,4.0,1.982186,0.280840
...,...,...,...,...,...,...,...
9495,9995,1.360779,-1.326233,-0.421502,NaN,NaN,NaN
9496,9996,-0.833311,-0.464816,-0.413557,NaN,NaN,NaN
9497,9997,-2.247892,-0.319841,-1.007784,NaN,NaN,NaN
9498,9998,-0.770215,0.541555,-1.960953,NaN,NaN,NaN
9499,9999,2.330945,-0.065626,-0.324061,NaN,NaN,NaN

In [88]:
df0.join(df3, lsuffix="_left", rsuffix="_right", how="inner")

     index_left         A         B         C  index_right         E         F
0           500  0.553991  0.954633 -1.088224            0 -1.897952  1.645780
1           501 -1.004000 -0.163454  0.278943            1 -0.306025 -1.647525
2           502  1.717211  0.133925 -0.094558            2 -0.023045 -1.034967
3           503  2.108882 -0.245954 -0.926120            3  0.862255 -0.015482
4           504 -0.441644  0.482727  0.852975            4  1.982186  0.280840
..          ...       ...       ...       ...          ...       ...       ...
995        1495 -2.226629  1.621649  0.391454          995  0.350883  1.016367
996        1496  0.867984  0.291900  0.109256          996  1.397034  2.873318
997        1497  0.081378  0.034038 -0.518349          997 -0.023402  0.201442
998        1498  0.917196 -0.397319  0.233449          998  1.127256 -0.325321
999        1499 -0.327985  0.641102  0.511884          999 -0.686507  1.295980

[1000 rows x 7 columns]

---
## Porównanie wydajności

In [89]:
%%timeit
pd.merge(df0, df3, on='index', how="right")

1.55 ms ± 18 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [90]:
%%timeit
df0.join(df3, lsuffix="_left", rsuffix="_right", how="inner")

542 µs ± 25.2 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

## <span style="color: cyan">WAŻNE</span>: Tak jak w bazie danych, róbmy `join` przy użyciu <span style="color: cyan">indeksów</span>
---

In [25]:
import os

try:
    os.remove('data/database.db')  # Czyszczenie starej bazy
except:
    pass

In [26]:
import sqlite3

conn = sqlite3.connect('data/database.db')

In [27]:
conn.execute('''CREATE TABLE COMPANY
         (ID INTEGER PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         CREATED DATETIME DEFAULT CURRENT_TIMESTAMP
         );'''
    );

In [28]:
conn.execute('''CREATE TABLE EMPLOYEE
         (ID INTEGER PRIMARY KEY     AUTOINCREMENT,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         SALARY         REAL,
         COMPANY_ID     INT     NOT NULL,
         CREATED DATETIME DEFAULT CURRENT_TIMESTAMP,
         FOREIGN KEY(COMPANY_ID) REFERENCES COMPANY(ID)
         );'''
    );

In [29]:
conn.execute("INSERT INTO COMPANY (ID,NAME) VALUES (1, 'ACME')");
conn.execute("INSERT INTO COMPANY (ID,NAME) VALUES (2, 'COLA')");
conn.execute("INSERT INTO COMPANY (ID,NAME) VALUES (3, 'TOYS')");

In [30]:
conn.execute("INSERT INTO EMPLOYEE (NAME,AGE,SALARY,COMPANY_ID) VALUES ('John D.', 40, 5000.0, 1)");
conn.execute("INSERT INTO EMPLOYEE (NAME,AGE,SALARY,COMPANY_ID) VALUES ('Bob B.', 35, 4500.0, 1)");
conn.execute("INSERT INTO EMPLOYEE (NAME,AGE,SALARY,COMPANY_ID) VALUES ('Alice B.', 50, 6000.0, 1)");
conn.execute("INSERT INTO EMPLOYEE (NAME,AGE,SALARY,COMPANY_ID) VALUES ('Jane G.', 35, 5000.0, 2)");
conn.execute("INSERT INTO EMPLOYEE (NAME,AGE,SALARY,COMPANY_ID) VALUES ('Alan T.', 50, 6000.0, 2)");

In [31]:
cursor = conn.execute("SELECT id, name from COMPANY")
for row in cursor:
    print(row)

(1, 'ACME')
(2, 'COLA')
(3, 'TOYS')

In [32]:
cursor = conn.execute("SELECT id, name, age, salary, company_id from EMPLOYEE")
for row in cursor:
    print(row)

(1, 'John D.', 40, 5000.0, 1)
(2, 'Bob B.', 35, 4500.0, 1)
(3, 'Alice B.', 50, 6000.0, 1)
(4, 'Jane G.', 35, 5000.0, 2)
(5, 'Alan T.', 50, 6000.0, 2)

In [37]:
cursor = conn.execute('''
SELECT 
    * 
FROM  
    COMPANY 
LEFT JOIN 
    EMPLOYEE 
ON 
    COMPANY.ID==EMPLOYEE.COMPANY_ID
''')
for row in cursor:
    print(row)

(1, 'ACME', '2023-11-27 21:29:38', 3, 'Alice B.', 50, 6000.0, 1, '2023-11-27 21:29:39')
(1, 'ACME', '2023-11-27 21:29:38', 2, 'Bob B.', 35, 4500.0, 1, '2023-11-27 21:29:39')
(1, 'ACME', '2023-11-27 21:29:38', 1, 'John D.', 40, 5000.0, 1, '2023-11-27 21:29:39')
(2, 'COLA', '2023-11-27 21:29:38', 5, 'Alan T.', 50, 6000.0, 2, '2023-11-27 21:29:39')
(2, 'COLA', '2023-11-27 21:29:38', 4, 'Jane G.', 35, 5000.0, 2, '2023-11-27 21:29:39')
(3, 'TOYS', '2023-11-27 21:29:38', None, None, None, None, None, None)

---
## Pandas a relacyjne bazy danych

In [38]:
import pandas as pd
import numpy as np

query = '''
SELECT 
   c.id as cid, 
   c.name as cname, 
   c.created as ccreated, 
   e.id as eid, 
   e.name as ename, 
   age,
   salary, 
   e.created as ecreated 
FROM
   COMPANY as C 
LEFT JOIN 
   EMPLOYEE as E 
ON 
   C.ID==E.COMPANY_ID
'''

df = pd.read_sql(query, conn)
df

,cid,cname,ccreated,eid,ename,AGE,SALARY,ecreated
0,1,ACME,2023-11-27 21:29:38,3.0,Alice B.,50.0,6000.0,2023-11-27 21:29:39
1,1,ACME,2023-11-27 21:29:38,2.0,Bob B.,35.0,4500.0,2023-11-27 21:29:39
2,1,ACME,2023-11-27 21:29:38,1.0,John D.,40.0,5000.0,2023-11-27 21:29:39
3,2,COLA,2023-11-27 21:29:38,5.0,Alan T.,50.0,6000.0,2023-11-27 21:29:39
4,2,COLA,2023-11-27 21:29:38,4.0,Jane G.,35.0,5000.0,2023-11-27 21:29:39
5,3,TOYS,2023-11-27 21:29:38,NaN,None,NaN,NaN,None

In [39]:
df.dtypes

cid           int64
cname        object
ccreated     object
eid         float64
ename        object
AGE         float64
SALARY      float64
ecreated     object
dtype: object

In [40]:
df = pd.read_sql(query, conn, parse_dates=['ccreated', 'ecreated'])
df

,cid,cname,ccreated,eid,ename,AGE,SALARY,ecreated
0,1,ACME,2023-11-27 21:29:38,3.0,Alice B.,50.0,6000.0,2023-11-27 21:29:39
1,1,ACME,2023-11-27 21:29:38,2.0,Bob B.,35.0,4500.0,2023-11-27 21:29:39
2,1,ACME,2023-11-27 21:29:38,1.0,John D.,40.0,5000.0,2023-11-27 21:29:39
3,2,COLA,2023-11-27 21:29:38,5.0,Alan T.,50.0,6000.0,2023-11-27 21:29:39
4,2,COLA,2023-11-27 21:29:38,4.0,Jane G.,35.0,5000.0,2023-11-27 21:29:39
5,3,TOYS,2023-11-27 21:29:38,NaN,None,NaN,NaN,NaT

In [41]:
df.dtypes

cid                  int64
cname               object
ccreated    datetime64[ns]
eid                float64
ename               object
AGE                float64
SALARY             float64
ecreated    datetime64[ns]
dtype: object

In [42]:
df = pd.DataFrame({'Student': {0: 'Kowalski J.', 1: 'Nowak A.', 2: 'Korzycki M.'},
                   'WuEf': {0: 5, 1: 4, 2: 2},
                   'Polski': {0: 4, 1: 4, 2: 2},
                   'Matma': {0: 5, 1: 3, 2: 2}})
df1 = pd.melt(df, id_vars=['Student'], value_vars=['WuEf', 'Matma', 'Polski'],
       var_name='Przedmiot', value_name='Ocena')
df1

       Student Przedmiot  Ocena
0  Kowalski J.      WuEf      5
1     Nowak A.      WuEf      4
2  Korzycki M.      WuEf      2
3  Kowalski J.     Matma      5
4     Nowak A.     Matma      3
5  Korzycki M.     Matma      2
6  Kowalski J.    Polski      4
7     Nowak A.    Polski      4
8  Korzycki M.    Polski      2

In [43]:
df1.to_sql('oceny', conn)

9

In [44]:
cursor = conn.execute("SELECT * from oceny")
for row in cursor:
    print(row)

(0, 'Kowalski J.', 'WuEf', 5)
(1, 'Nowak A.', 'WuEf', 4)
(2, 'Korzycki M.', 'WuEf', 2)
(3, 'Kowalski J.', 'Matma', 5)
(4, 'Nowak A.', 'Matma', 3)
(5, 'Korzycki M.', 'Matma', 2)
(6, 'Kowalski J.', 'Polski', 4)
(7, 'Nowak A.', 'Polski', 4)
(8, 'Korzycki M.', 'Polski', 2)

In [45]:
df1.to_sql('oceny', conn, if_exists='append')

9

In [46]:
cursor = conn.execute("SELECT * from oceny")
for row in cursor:
    print(row)

(0, 'Kowalski J.', 'WuEf', 5)
(1, 'Nowak A.', 'WuEf', 4)
(2, 'Korzycki M.', 'WuEf', 2)
(3, 'Kowalski J.', 'Matma', 5)
(4, 'Nowak A.', 'Matma', 3)
(5, 'Korzycki M.', 'Matma', 2)
(6, 'Kowalski J.', 'Polski', 4)
(7, 'Nowak A.', 'Polski', 4)
(8, 'Korzycki M.', 'Polski', 2)
(0, 'Kowalski J.', 'WuEf', 5)
(1, 'Nowak A.', 'WuEf', 4)
(2, 'Korzycki M.', 'WuEf', 2)
(3, 'Kowalski J.', 'Matma', 5)
(4, 'Nowak A.', 'Matma', 3)
(5, 'Korzycki M.', 'Matma', 2)
(6, 'Kowalski J.', 'Polski', 4)
(7, 'Nowak A.', 'Polski', 4)
(8, 'Korzycki M.', 'Polski', 2)

In [47]:
df1.to_sql('oceny', conn, if_exists='replace')
cursor = conn.execute("SELECT * from oceny")
for row in cursor:
    print(row)

(0, 'Kowalski J.', 'WuEf', 5)
(1, 'Nowak A.', 'WuEf', 4)
(2, 'Korzycki M.', 'WuEf', 2)
(3, 'Kowalski J.', 'Matma', 5)
(4, 'Nowak A.', 'Matma', 3)
(5, 'Korzycki M.', 'Matma', 2)
(6, 'Kowalski J.', 'Polski', 4)
(7, 'Nowak A.', 'Polski', 4)
(8, 'Korzycki M.', 'Polski', 2)

---
## Odpowiedniki SQL w Pandasie

### `SELECT`

In [48]:
employee = pd.read_sql('SELECT id, name, age, salary, company_id FROM EMPLOYEE', conn)
employee

   ID      NAME  AGE  SALARY  COMPANY_ID
0   1   John D.   40  5000.0           1
1   2    Bob B.   35  4500.0           1
2   3  Alice B.   50  6000.0           1
3   4   Jane G.   35  5000.0           2
4   5   Alan T.   50  6000.0           2

In [50]:
pd.read_sql('SELECT id, name, age, salary FROM EMPLOYEE', conn)

   ID      NAME  AGE  SALARY
0   1   John D.   40  5000.0
1   2    Bob B.   35  4500.0
2   3  Alice B.   50  6000.0
3   4   Jane G.   35  5000.0
4   5   Alan T.   50  6000.0

In [51]:
employee[['ID', 'NAME', 'AGE', 'SALARY']]

   ID      NAME  AGE  SALARY
0   1   John D.   40  5000.0
1   2    Bob B.   35  4500.0
2   3  Alice B.   50  6000.0
3   4   Jane G.   35  5000.0
4   5   Alan T.   50  6000.0

### `WHERE`

In [52]:
pd.read_sql(
'''
SELECT 
   id, name, age, salary, company_id 
FROM 
   EMPLOYEE 
WHERE 
   AGE>40
''', conn)

   ID      NAME  AGE  SALARY  COMPANY_ID
0   3  Alice B.   50  6000.0           1
1   5   Alan T.   50  6000.0           2

In [53]:
employee[employee["AGE"] > 40]

   ID      NAME  AGE  SALARY  COMPANY_ID
2   3  Alice B.   50  6000.0           1
4   5   Alan T.   50  6000.0           2

### `GROUP BY`

In [54]:
pd.read_sql('''
SELECT
    company_id, count(*) 
FROM 
    EMPLOYEE 
GROUP BY COMPANY_ID
''', conn)

   COMPANY_ID  count(*)
0           1         3
1           2         2

In [59]:
pd.DataFrame(employee.groupby('COMPANY_ID')["NAME"].count()).reset_index()

   COMPANY_ID  NAME
0           1     3
1           2     2

### `JOIN`

In [64]:
company = pd.read_sql('SELECT id, name FROM COMPANY', conn)
company

   ID  NAME
0   1  ACME
1   2  COLA
2   3  TOYS

In [65]:
query = '''
SELECT 
   C.id as ID_COMPANY,
   c.name as NAME_COMPANY,  
   e.id as ID_EMPLOYEE, 
   e.name as NAME_EMPLOYEE, 
   age,
   salary, 
   company_id
FROM
   COMPANY as C 
LEFT JOIN 
   EMPLOYEE as E 
ON 
   C.ID==E.COMPANY_ID
'''
pd.read_sql(query, conn)

,ID_COMPANY,NAME_COMPANY,ID_EMPLOYEE,NAME_EMPLOYEE,AGE,SALARY,COMPANY_ID
0,1,ACME,3.0,Alice B.,50.0,6000.0,1.0
1,1,ACME,2.0,Bob B.,35.0,4500.0,1.0
2,1,ACME,1.0,John D.,40.0,5000.0,1.0
3,2,COLA,5.0,Alan T.,50.0,6000.0,2.0
4,2,COLA,4.0,Jane G.,35.0,5000.0,2.0
5,3,TOYS,NaN,None,NaN,NaN,NaN

In [66]:
company.merge(employee, left_on='ID', right_on='COMPANY_ID', suffixes=("_COMPANY","_EMPLOYEE"))

   ID_COMPANY NAME_COMPANY  ID_EMPLOYEE NAME_EMPLOYEE  AGE  SALARY  COMPANY_ID
0           1         ACME            1       John D.   40  5000.0           1
1           1         ACME            2        Bob B.   35  4500.0           1
2           1         ACME            3      Alice B.   50  6000.0           1
3           2         COLA            4       Jane G.   35  5000.0           2
4           2         COLA            5       Alan T.   50  6000.0           2

---
## Dodatkowa sztuczka

### `SQLITE` w pamięci !

In [ ]:
import sqlite3

conn = sqlite3.connect(':memory:')

---
## Podsumowanie
### Wady i zalety `SQL` vs `Pandas`

### Za Pandasem
- #### W Pandas można łatwo przechodzic <span style="color: cyan">między kolumnami a wierszami</span>
- #### W Pandas możemy mieć <span style="color: cyan">hierarchiczne metadane</span>(`MultiIndex`) w kolumnach i <span style="color: cyan">wierszach</span>
- #### W Pandas format wyjścia jest <span style="color: cyan">elastyczny</span>
- #### Jest wiele narzędzi/bibliotek do przetwarzania danych w Pythonie z których można korzystać

### Za SQL-em
- #### Sprawniejszy przy dużych zbiorach danych 
  - ##### <span style="color: cyan">Dużych</span> - *czyli więcej danych niż mi się mieści w RAM-ie (ang. Out-of-Core)*
- #### Sformalizowany, <span style="color: cyan">nieelastyczny format</span>